app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Dana"], ["last_name", "Tootsie"], ["created_at", "2021-03-25 17:50:05.228730"], ["updated_at", "2021-03-25 17:50:05.228730"]]
---
    def create
        @student = Student.create(params.require(:student).permit(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Wallace"], ["updated_at", "2021-03-25 17:53:00.273936"], ["id", 3]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(params.require(:student).permit(:first_name, :last_name))